## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-11-29T18:03:42Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/" -> (known after apply)
      ~ id                = "0lnfjp" -> (known after apply)
      ~ invoke_url        = "https://zjyu1t6h7e.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ stage_description = "068444438ce4e32fe10da5af5698fa6c" -> "a42298b65c546fc7cb36e4ed878e4e33" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "0lnfjp" -> (known after apply)
        id                    = "ags-zjyu1t6h7e-v1"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
